modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorDispersion/constant/quadratureProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      quadratureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldMomentInversion    extendedFieldMomentInversion;

extendedMomentInversion
{
    extendedMomentInversion     lognormal;

    maxSigmaIter        1000;
    momentsTol          1.0e-6;
    sigmaMin            1.0e-8;
    targetFunctionTol   1.0e-8;

    basicQuadrature
    {
        univariateMomentInversion   Gauss;
    }
}

momentAdvection
{
    basicMomentInversion
    {
        univariateMomentInversion GaussRadau;
    }
}

moments
(
    (0)
    (1)
    (2)
    (3)
    (4)
);

nodes
(
    (0)
    (1)
);

extendedMomentInversionCoeff
{
    extendedMomentInversion     lognormal;

    maxSigmaIter        1000;
    momentsTol          1.0e-6;
    sigmaTol            1.0e-8;
    targetFunctionTol   1.0e-8;

    basicQuadrature
    {
        univariateMomentInversion   Gauss;
    }
}

fluxQuadrature
{
    univariateMomentInversion   GaussRadau;
}


// ************************************************************************* //
